# **Pandas LAB**

### Step 1. Import the necessary libraries

In [27]:
import pandas as pd

### Step 2. Get the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [28]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',index_col=0, sep= '|')

### Step 4. See the first 25 entries

In [29]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [30]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [31]:
users.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [32]:
users.shape[1]

4

### Step 8. Print the name of all the columns.

In [33]:
for name in users.columns:
    print(name)

age
gender
occupation
zip_code

### Step 9. How is the dataset indexed?

In [34]:
users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [35]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 11. Print only the occupation column

In [36]:
users[['occupation']]

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

### Step 12. How many different occupations are in this dataset?

In [37]:
count = 0
for occupation in users['occupation'].unique():
    print(occupation)
    count += 1

print(f'We have {count} different occupations in the dataset.')

technician
other
writer
executive
administrator
student
lawyer
educator
scientist
entertainment
programmer
librarian
homemaker
artist
engineer
marketing
none
healthcare
retired
salesman
doctor
We have 21 different occupations in the dataset.

### Step 13. What is the most frequent occupation?

In [38]:
print(users['occupation'].value_counts().idxmax())
print(users['occupation'].value_counts().max()) ## or [0]

student
196

### Step 14. Summarize the DataFrame.

In [39]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

## **Group by Operations**

### Count the number of users in each occupation.

In [40]:
users.groupby('occupation').size()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
dtype: int64

### Calculate the average age of users by gender.

In [41]:
users.groupby('gender')['age'].mean()

gender
F    33.813187
M    34.149254
Name: age, dtype: float64

In [42]:
users.groupby('gender').age.agg(['mean'])

             mean
gender
F       33.813187
M       34.149254

### Find the minimum, maximum, and average age for each occupation.

In [43]:
users.groupby('occupation').age.agg(['min' ,'max' , 'mean'])

               min  max       mean
occupation
administrator   21   70  38.746835
artist          19   48  31.392857
doctor          28   64  43.571429
educator        23   63  42.010526
engineer        22   70  36.388060
entertainment   15   50  29.222222
executive       22   69  38.718750
healthcare      22   62  41.562500
homemaker       20   50  32.571429
lawyer          21   53  36.750000
librarian       23   69  40.000000
marketing       24   55  37.615385
none            11   55  26.555556
other           13   64  34.523810
programmer      20   63  33.121212
retired         51   73  63.071429
salesman        18   66  35.666667
scientist       23   55  35.548387
student          7   42  22.081633
technician      21   55  33.148148
writer          18   60  36.311111

### For each occupation, calculate the percentage of users who are male.

In [44]:
num_of_users = users.shape[0]
users.groupby('occupation').apply(lambda x: (x['gender'] == 'M').sum() / num_of_users * 100)

C:\Users\karee\AppData\Local\Temp\ipykernel_34308\3352558490.py:2: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  users.groupby('occupation').apply(lambda x: (x['gender'] == 'M').sum() / num_of_users * 100)

occupation
administrator     4.559915
artist            1.590668
doctor            0.742312
educator          7.317073
engineer          6.892895
entertainment     1.696713
executive         3.075292
healthcare        0.530223
homemaker         0.106045
lawyer            1.060445
librarian         2.332980
marketing         1.696713
none              0.530223
other             7.317073
programmer        6.362672
retired           1.378579
salesman          0.954401
scientist         2.969247
student          14.422057
technician        2.757158
writer            2.757158
dtype: float64

## **Filtering**

### Filter the dataset to show only female users.

In [45]:
users[users['gender'] == 'F']

         age gender  occupation zip_code
user_id
2         53      F       other    94043
5         33      F       other    15213
11        39      F       other    30329
12        28      F       other    06405
15        49      F    educator    97301
...      ...    ...         ...      ...
925       18      F    salesman    49036
930       28      F   scientist    07310
938       38      F  technician    55038
939       26      F     student    33319
942       48      F   librarian    78209

[273 rows x 4 columns]

### Filter the dataset to show users who are either students or educators.

In [46]:
users[users['occupation'].isin(['doctor' , 'student'])]

         age gender occupation zip_code
user_id
9         29      M    student    01002
30         7      M    student    55436
32        28      F    student    78741
33        23      M    student    27510
36        19      F    student    93117
...      ...    ...        ...      ...
933       28      M    student    48105
935       42      M     doctor    66221
939       26      F    student    33319
941       20      M    student    97229
943       22      M    student    77841

[203 rows x 4 columns]

### Filter the dataset to show female users who are in their 20s (20-29).

In [47]:
female_users = users[users['gender'] == 'F']

In [48]:
female_users[(female_users['age'] >= 20) & (female_users['age'] < 30)]

         age gender     occupation zip_code
user_id
12        28      F          other    06405
24        21      F         artist    94533
32        28      F        student    78741
35        20      F      homemaker    42459
38        28      F          other    54467
...      ...    ...            ...      ...
917       22      F        student    20006
921       20      F        student    98801
922       29      F  administrator    21114
930       28      F      scientist    07310
939       26      F        student    33319

[85 rows x 4 columns]

### Filter the dataset to find users from California (zip codes starting with '9')

In [49]:
users[users['zip_code'].str.startswith('9')]

         age gender     occupation zip_code
user_id
2         53      F          other    94043
6         42      M      executive    98101
7         57      M  administrator    91344
10        53      M         lawyer    90703
15        49      F       educator    97301
...      ...    ...            ...      ...
902       45      F         artist    97203
920       30      F         artist    90008
921       20      F        student    98801
937       48      M       educator    98072
941       20      M        student    97229

[170 rows x 4 columns]

# **Complex Analysis**

### Create a pivot table showing the count of users by occupation and age decade.
#### age decade: 27 years old --> 20s decade

In [50]:
users['age_decade'] = users['age'] // 10

users.groupby(['occupation','age_decade']).size()

occupation     age_decade
administrator  2             19
               3             26
               4             20
               5             12
               6              1
                             ..
writer         2             14
               3              9
               4             13
               5              6
               6              1
Length: 100, dtype: int64